untestedTutorials/reactingCylSimple/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name reactingCells;
        type cellSet;
        action new;
        source cylinderAnnulusToCell;
        sourceInfo
        {
            p1 (0 0 -1e-2);
            p2 (0 0 0e-2);
            innerRadius 2e-3;
            outerRadius 6e-3;
        }
    }
    {
        name    reactingCellZone;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        sourceInfo
        {
            set reactingCells;
        }
    } 
);

// ************************************************************************* //
